reconstructPar_parallel/system/blockMeshDict
/*--------------------------------*Thien Phan*-------------------------------*\																	
| =========                 |                                                 |																	
| \\      /  F ield         | OpenFOAM: phanquocthien.org                     |																	
|  \\    /   O peration     | Files are generated by Thien Phan               |																	
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |																	
|    \\/     M anipulation  |         PhanQuocThien@gmail.com                 |																	
\*---------------------------------------------------------------------------*/																	
FoamFile																	
{																	
    version     2.0;																	
    format      ascii;																	
    class       dictionary;																	
    object      blockMeshDict;																	
}																	
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //																	
convertToMeters	1	;															
																	
geometry																	
{																	
}																	
																	
vertices																	
(																	
	(	0	0	0	)	//	0										
	(	1	0	0	)	//	1										
	(	1	12	0	)	//	2										
	(	-11	0	0	)	//	3										
	(	0	0	1	)	//	4										
	(	1	0	1	)	//	5										
	(	1	12	1	)	//	6										
	(	-11	0	1	)	//	7										
	(	21	0	0	)	//	8										
	(	21	12	0	)	//	9										
	(	21	0	1	)	//	10										
	(	21	12	1	)	//	11										
	(	1	-12	0	)	//	12										
	(	1	-12	1	)	//	13										
	(	21	-12	0	)	//	14										
	(	21	-12	1	)	//	15										
	(	1	0	0	)	//	16										
	(	1	0	1	)	//	17										
																	
);																	
																	
																	
blocks																	
(																	
	hex	(0	1	2	3	4	5	6	7)	(	41	48	1	)	//block	1	
	edgeGrading																
	(																
	//	x-direction	expansion	ratio													
	(																
(	0.4	0.512195122	3.5	)													
(	0.6	0.487804878	0.857142857	)													
	)																
	0.06	0.06															
	(																
(	0.4	0.512195122	3.5	)													
(	0.6	0.487804878	0.857142857	)													
	)																
	//	y-direction	expansion	ratio													
	(																
(	0.041666667	0.354166667	22.18611107	)													
(	0.958333333	0.645833333	4.507324411	)													
	)																
	(																
(	0.041666667	0.354166667	22.18611107	)													
(	0.958333333	0.645833333	4.507324411	)													
	)																
	(																
(	0.041666667	0.354166667	22.18611107	)													
(	0.958333333	0.645833333	4.507324411	)													
	)																
	(																
(	0.041666667	0.354166667	22.18611107	)													
(	0.958333333	0.645833333	4.507324411	)													
	)																
																	
	//	z-direction	expansion	ratio													
	1	1	1	1													
	)																
																	
	hex	(1	8	9	2	5	10	11	6)	(	74	48	1)	//block	2		
	edgeGrading																
	(																
	//	x-direction	expansion	ratio													
	16.66666667	16.66666667	16.66666667	16.66666667													
	//	y-direction	expansion	ratio													
	(																
(	0.041666667	0.354166667	22.18611107	)													
(	0.958333333	0.645833333	4.507324411	)													
	)																
	6.979082959	6.979082959															
	(																
(	0.041666667	0.354166667	22.18611107	)													
(	0.958333333	0.645833333	4.507324411	)													
	)																
																	
	//	z-direction	expansion	ratio													
	1	1	1	1													
	)																
																	
	hex	(3	12	16	0	7	13	17	4)	(	41	48	1	)	//block	3	
	edgeGrading																
	(																
	//	x-direction	expansion	ratio													
	0.06																
	(																
(	0.4	0.512195122	3.5	)													
(	0.6	0.487804878	0.857142857	)													
	)																
	(																
(	0.4	0.512195122	3.5	)													
(	0.6	0.487804878	0.857142857	)													
	)																
	0.06																
	//	y-direction	expansion	ratio													
	(																
(	0.958333333	0.645833333	0.221861111	)													
(	0.041666667	0.354166667	0.045073244	)													
	)																
	(																
(	0.958333333	0.645833333	0.221861111	)													
(	0.041666667	0.354166667	0.045073244	)													
	)																
	(																
(	0.958333333	0.645833333	0.221861111	)													
(	0.041666667	0.354166667	0.045073244	)													
	)																
	(																
(	0.958333333	0.645833333	0.221861111	)													
(	0.041666667	0.354166667	0.045073244	)													
	)																
																	
	//	z-direction	expansion	ratio													
	1	1	1	1													
	)																
																	
																	
																	
																	
																	
	hex	(12	14	8	16	13	15	10	17)	(	74	48	1)	//block	4		
	edgeGrading																
	(																
	//	x-direction	expansion	ratio													
	16.66666667	16.66666667	16.66666667	16.66666667													
	//	y-direction	expansion	ratio													
	(																
(	0.958333333	0.645833333	0.221861111	)													
(	0.041666667	0.354166667	0.045073244	)													
	)																
	0.143285301	0.143285301															
	(																
(	0.958333333	0.645833333	0.221861111	)													
(	0.041666667	0.354166667	0.045073244	)													
	)																
																	
	//	z-direction	expansion	ratio													
	1	1	1	1													
	)																
);																	
																	
																	
edges																	
(																	
	arc	3 2	(	-7.485281374	8.485281374	0	)										
	arc	7 6	(	-7.485281374	8.485281374	1	)										
																	
	spline	1	0														
	(																
	(	0.999414571	0.001635306	0	)												
	(	0.99657484	0.002915282	0	)												
	(	0.991851077	0.005030806	0	)												
	(	0.985257036	0.007955542	0	)												
	(	0.976812098	0.011653237	0	)												
	(	0.96654139	0.016078325	0	)												
	(	0.954475916	0.021176659	0	)												
	(	0.940652691	0.026886365	0	)												
	(	0.925114864	0.033138784	0	)												
	(	0.907911833	0.039859482	0	)												
	(	0.889099319	0.046969298	0	)												
	(	0.868739414	0.054385404	0	)												
	(	0.846900584	0.062022367	0	)												
	(	0.823657634	0.069793174	0	)												
	(	0.799091629	0.077610224	0	)												
	(	0.773289778	0.085386272	0	)												
	(	0.746345281	0.093035319	0	)												
	(	0.718357147	0.100473449	0	)												
	(	0.689429984	0.107619624	0	)												
	(	0.659673757	0.114396433	0	)												
	(	0.629203524	0.120730817	0	)												
	(	0.59813913	0.126554773	0	)												
	(	0.566604869	0.131806038	0	)												
	(	0.534729082	0.136428766	0	)												
	(	0.50264371	0.140374201	0	)												
	(	0.470483754	0.143601317	0	)												
	(	0.438386668	0.146077442	0	)												
	(	0.406491647	0.147778824	0	)												
	(	0.374044047	0.148488213	0	)												
	(	0.341845108	0.147791733	0	)												
	(	0.310292497	0.145718709	0	)												
	(	0.279553537	0.142333557	0	)												
	(	0.249790778	0.137720901	0	)												
	(	0.221159832	0.13198378	0	)												
	(	0.193807454	0.125241411	0	)												
	(	0.167869929	0.117626567	0	)												
	(	0.143471825	0.109282688	0	)												
	(	0.120725102	0.100360782	0	)												
	(	0.099728594	0.091016229	0	)												
	(	0.080567827	0.081405559	0	)												
	(	0.063315132	0.071683253	0	)												
	(	0.048030006	0.061998663	0	)												
	(	0.034759665	0.052493072	0	)												
	(	0.023539725	0.04329696	0	)												
	(	0.014394966	0.034527513	0	)												
	(	0.007340096	0.02628641	0	)												
	(	0.002380497	0.018657929	0	)												
	(	-0.000487128	0.011707392	0	)												
	(	-0.001274222	0.00547999	0	)												
	)																
																	
																	
	spline	5	4														
	(																
	(	0.999414571	0.001635306	1	)												
	(	0.99657484	0.002915282	1	)												
	(	0.991851077	0.005030806	1	)												
	(	0.985257036	0.007955542	1	)												
	(	0.976812098	0.011653237	1	)												
	(	0.96654139	0.016078325	1	)												
	(	0.954475916	0.021176659	1	)												
	(	0.940652691	0.026886365	1	)												
	(	0.925114864	0.033138784	1	)												
	(	0.907911833	0.039859482	1	)												
	(	0.889099319	0.046969298	1	)												
	(	0.868739414	0.054385404	1	)												
	(	0.846900584	0.062022367	1	)												
	(	0.823657634	0.069793174	1	)												
	(	0.799091629	0.077610224	1	)												
	(	0.773289778	0.085386272	1	)												
	(	0.746345281	0.093035319	1	)												
	(	0.718357147	0.100473449	1	)												
	(	0.689429984	0.107619624	1	)												
	(	0.659673757	0.114396433	1	)												
	(	0.629203524	0.120730817	1	)												
	(	0.59813913	0.126554773	1	)												
	(	0.566604869	0.131806038	1	)												
	(	0.534729082	0.136428766	1	)												
	(	0.50264371	0.140374201	1	)												
	(	0.470483754	0.143601317	1	)												
	(	0.438386668	0.146077442	1	)												
	(	0.406491647	0.147778824	1	)												
	(	0.374044047	0.148488213	1	)												
	(	0.341845108	0.147791733	1	)												
	(	0.310292497	0.145718709	1	)												
	(	0.279553537	0.142333557	1	)												
	(	0.249790778	0.137720901	1	)												
	(	0.221159832	0.13198378	1	)												
	(	0.193807454	0.125241411	1	)												
	(	0.167869929	0.117626567	1	)												
	(	0.143471825	0.109282688	1	)												
	(	0.120725102	0.100360782	1	)												
	(	0.099728594	0.091016229	1	)												
	(	0.080567827	0.081405559	1	)												
	(	0.063315132	0.071683253	1	)												
	(	0.048030006	0.061998663	1	)												
	(	0.034759665	0.052493072	1	)												
	(	0.023539725	0.04329696	1	)												
	(	0.014394966	0.034527513	1	)												
	(	0.007340096	0.02628641	1	)												
	(	0.002380497	0.018657929	1	)												
	(	-0.000487128	0.011707392	1	)												
	(	-0.001274222	0.00547999	1	)												
	)																
																	
																	
	arc	3 12	(	-7.485281374	-8.485281374	0	)										
	arc	7 13	(	-7.485281374	-8.485281374	1	)										
																	
	spline	0	16														
	(																
	(	0.003247493	-0.004593113	0	)												
	(	0.008372426	-0.008176495	0	)												
	(	0.015332252	-0.010775431	0	)												
	(	0.024076743	-0.012426431	0	)												
	(	0.034548518	-0.01317667	0	)												
	(	0.046683789	-0.013083318	0	)												
	(	0.060413283	-0.012212777	0	)												
	(	0.075663314	-0.010639805	0	)												
	(	0.092356943	-0.008446574	0	)												
	(	0.110415179	-0.005721662	0	)												
	(	0.129758163	-0.002558987	0	)												
	(	0.15030627	0.000943272	0	)												
	(	0.171981069	0.004683778	0	)												
	(	0.194706081	0.008559129	0	)												
	(	0.218407294	0.012464945	0	)												
	(	0.243013373	0.016296947	0	)												
	(	0.268455548	0.019952031	0	)												
	(	0.294667171	0.023329361	0	)												
	(	0.321582951	0.026331516	0	)												
	(	0.349137898	0.028865694	0	)												
	(	0.377266066	0.030845026	0	)												
	(	0.406127038	0.032201272	0	)												
	(	0.436280099	0.033225667	0	)												
	(	0.466725726	0.034045378	0	)												
	(	0.49735629	0.034625799	0	)												
	(	0.528061437	0.034938877	0	)												
	(	0.558728365	0.034963748	0	)												
	(	0.589242184	0.034687191	0	)												
	(	0.619486363	0.034103856	0	)												
	(	0.649343238	0.03321628	0	)												
	(	0.678694569	0.032034688	0	)												
	(	0.707422145	0.030576586	0	)												
	(	0.735408393	0.028866172	0	)												
	(	0.762537017	0.026933594	0	)												
	(	0.788693623	0.024814076	0	)												
	(	0.813766356	0.022546959	0	)												
	(	0.837646522	0.020174685	0	)												
	(	0.860229214	0.017741757	0	)												
	(	0.881413924	0.015293708	0	)												
	(	0.901105162	0.012876106	0	)												
	(	0.919213061	0.010533614	0	)												
	(	0.935653989	0.008309127	0	)												
	(	0.950351136	0.006242989	0	)												
	(	0.963235096	0.004372312	0	)												
	(	0.974244418	0.002730375	0	)												
	(	0.983326125	0.001346133	0	)												
	(	0.990436173	0.000243801	0	)												
	(	0.995539862	-0.000557465	0	)												
	(	0.998612158	-0.001043811	0	)												
	)																
																	
																	
	spline	4	17														
	(																
	(	0.003247493	-0.004593113	1	)												
	(	0.008372426	-0.008176495	1	)												
	(	0.015332252	-0.010775431	1	)												
	(	0.024076743	-0.012426431	1	)												
	(	0.034548518	-0.01317667	1	)												
	(	0.046683789	-0.013083318	1	)												
	(	0.060413283	-0.012212777	1	)												
	(	0.075663314	-0.010639805	1	)												
	(	0.092356943	-0.008446574	1	)												
	(	0.110415179	-0.005721662	1	)												
	(	0.129758163	-0.002558987	1	)												
	(	0.15030627	0.000943272	1	)												
	(	0.171981069	0.004683778	1	)												
	(	0.194706081	0.008559129	1	)												
	(	0.218407294	0.012464945	1	)												
	(	0.243013373	0.016296947	1	)												
	(	0.268455548	0.019952031	1	)												
	(	0.294667171	0.023329361	1	)												
	(	0.321582951	0.026331516	1	)												
	(	0.349137898	0.028865694	1	)												
	(	0.377266066	0.030845026	1	)												
	(	0.406127038	0.032201272	1	)												
	(	0.436280099	0.033225667	1	)												
	(	0.466725726	0.034045378	1	)												
	(	0.49735629	0.034625799	1	)												
	(	0.528061437	0.034938877	1	)												
	(	0.558728365	0.034963748	1	)												
	(	0.589242184	0.034687191	1	)												
	(	0.619486363	0.034103856	1	)												
	(	0.649343238	0.03321628	1	)												
	(	0.678694569	0.032034688	1	)												
	(	0.707422145	0.030576586	1	)												
	(	0.735408393	0.028866172	1	)												
	(	0.762537017	0.026933594	1	)												
	(	0.788693623	0.024814076	1	)												
	(	0.813766356	0.022546959	1	)												
	(	0.837646522	0.020174685	1	)												
	(	0.860229214	0.017741757	1	)												
	(	0.881413924	0.015293708	1	)												
	(	0.901105162	0.012876106	1	)												
	(	0.919213061	0.010533614	1	)												
	(	0.935653989	0.008309127	1	)												
	(	0.950351136	0.006242989	1	)												
	(	0.963235096	0.004372312	1	)												
	(	0.974244418	0.002730375	1	)												
	(	0.983326125	0.001346133	1	)												
	(	0.990436173	0.000243801	1	)												
	(	0.995539862	-0.000557465	1	)												
	(	0.998612158	-0.001043811	1	)												
	)																
																	
																	
);																	
																	
faces																	
(																	
																	
);																	
																	
faces																	
(																	
  																	
);																	
																	
																	
defaultPatch																	
{																	
    name frontAndBack;																	
    type empty;																	
}																	
																	
boundary																	
(																	
inlet              // patch name																	
        {																	
            type patch; 																	
            faces																	
            (																	
                (3 12 13 7  )																	
                (2 3 7 6  )  																	
                (12 15 14 13  )																	
            );																	
        }																	
																	
outlet              // patch name																	
        {																	
            type patch;    																	
            faces																	
            (																	
                (9 2 6 11)  																	
                (8 9 10 11)  																	
                (15 8 10 14  ) 																	
            );																	
        }																	
																	
walls              // patch name																	
        {																	
            type wall; 																	
            faces																	
            (																	
                (0 1 5 4)  																	
                (0 4 17 16  ) 																	
            );																	
        }																	
																	
interface1              // patch name																	
        {																	
            type patch;   																	
            faces																	
            (																	
                (1 8 10 5)  																	
            );																	
        }																	
interface2              // patch name																	
        {																	
            type patch;    																	
            faces																	
            (																	
                (16 17 10 8)  																	
            );																	
        }																	
);																	
																	
 mergePatchPairs																	
(																	
    ( interface1 interface2 )																	
);																	
// ************************************************************************* //																	
